[
  {
    "title": "Life’s Greatest Leap: Scientists Decode the Origins of Complex Cells - SciTechDaily",
    "description": "Eukaryogenesis occurred suddenly, driven by the growing length of genes and the limitations on producing longer proteins. An international team of four senior scientists from Mainz, Valencia, Madrid, and Zurich has published groundbreaking research in the jou…",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/?p=473239",
    "publishedAt": "2025-05-11T03:26:29Z"
  },
  {
    "title": "NASA Is Increasing Employee Location Tracking - NASA Watch",
    "description": "It would seem that DOGE is tracking NASA employees as they come - and go - at NASA Headquarters",
    "source": "Nasawatch.com",
    "url": "https://nasawatch.com/personnel-news/nasa-is-increasing-employee-location-tracking/",
    "publishedAt": "2025-05-11T01:21:43Z"
  },
  {
    "title": "Einstein’s Relativity Predicted a Twisted Illusion – Now Scientists Have Finally Seen It - SciTechDaily",
    "description": "Einstein’s strangest optical illusion has been captured—thanks to lasers, a cube, and a bit of artistic inspiration.",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/einsteins-relativity-predicted-a-twisted-illusion-now-scientists-have-finally-seen-it/",
    "publishedAt": "2025-05-10T22:31:22Z"
  },
  {
    "title": "This Giant Fossil Egg Sat In A Museum Storage For Years - The Daily Galaxy",
    "description": "It sat unnoticed in a museum for nearly a decade. Now, this ancient egg is shaking up what we thought we knew about ocean predators from the dinosaur age.",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/05/giant-fossil-egg-sat-storage-for-years/",
    "publishedAt": "2025-05-10T18:30:00Z"
  },
  {
    "title": "Soviet-era spacecraft crashes back to Earth after 53 years stuck in orbit - France 24",
    "description": "A Soviet-era spacecraft that was designed to land on the surface of Venus crashed down to earth on Saturday, decades after it was launched. The European Union Space Surveillance and Tracking agency confirmed the uncontrolled re-entry of Kosmos 482 but could n…",
    "source": "FRANCE 24 English",
    "url": "https://www.france24.com/en/europe/20250510-soviet-era-spacecraft-crashes-back-to-earth-after-53-years-stuck-in-orbit",
    "publishedAt": "2025-05-10T18:29:12Z"
  },
  {
    "title": "Mysterious Pyramid Found in Antarctica: A Natural Wonder or an Alien Artifact? - Indian Defence Review",
    "description": "Deep in the frozen wilderness of Antarctica lies a 'pyramid' that has baffled both scientists and conspiracy theorists alike.",
    "source": "Indiandefencereview.com",
    "url": "https://indiandefencereview.com/mysterious-pyramid-found-in-antarctica/",
    "publishedAt": "2025-05-10T17:45:00Z"
  },
  {
    "title": "Stormy waves traversing the Earth's core provide new hints into future planetary exploration - Phys.org",
    "description": "The detection of energy signals from strong winter storms in the North Atlantic Ocean that travel through Earth's core could enhance understanding of our solar system, according to new research from The Australian National University (ANU).",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-05-stormy-traversing-earth-core-hints.html",
    "publishedAt": "2025-05-10T17:30:01Z"
  },
  {
    "title": "Scientists Reveal Strange Phenomenon of ‘Ice Piracy’ in Antarctica - The Daily Galaxy",
    "description": "A new study using Copernicus Sentinel-1 data reveals that glaciers in West Antarctica are undergoing rapid ice piracy.",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/05/strange-phenomenon-ice-piracy-antarctica/",
    "publishedAt": "2025-05-10T16:40:00Z"
  },
  {
    "title": "My Husband Played a Terrifying Prank on Me. So I’ve Figured Out the Perfect Way to Retaliate. - Slate Magazine",
    "description": "I'm furious.",
    "source": "Slate Magazine",
    "url": "https://slate.com/advice/2025/05/marriage-advice-husband-prank-terrifying.html",
    "publishedAt": "2025-05-10T16:00:00Z"
  },
  {
    "title": "Scientists Discover 140-Million-Year-Old Lost Continent Beneath Southern Europe - The Daily Galaxy",
    "description": "A vast lost continent lies hidden beneath Europe’s mountains—its ancient secrets now reshaping our understanding of Earth’s history.",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/05/140-million-year-old-lost-continent-europe/",
    "publishedAt": "2025-05-10T15:15:00Z"
  },
  {
    "title": "Hubble Space Telescope Uncovers Rogue Black Hole Devouring Star 600 Million Light-Years Away - The Daily Galaxy",
    "description": "Astronomers have caught a wandering black hole, 600 million light-years away, tearing apart a star in an unprecedented event—marking a new frontier in black hole research.",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/05/hubble-rogue-black-hole-devouring-star/",
    "publishedAt": "2025-05-10T14:30:00Z"
  },
  {
    "title": "Nanoplastics generated from real-world plastic waste readily adsorb heavy metal ions, study reveals - Phys.org",
    "description": "Some 460 million metric tons of plastic are produced globally each year, out of which a staggering 91% of plastic waste is never recycled—with 12% incinerated and 79% left to end up in landfills and oceans and linger in our environment.",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-05-nanoplastics-generated-real-world-plastic.html",
    "publishedAt": "2025-05-10T14:20:01Z"
  },
  {
    "title": "A Chorus of Gravitational Waves Emerging from the Milky Way Core: Will We Ever Hear Them? - The Daily Galaxy",
    "description": "A cosmic symphony of gravitational waves is echoing from the heart of the Milky Way—are we about to hear it?",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/05/a-chorus-of-gravitational-waves-milky-way/",
    "publishedAt": "2025-05-10T13:30:00Z"
  },
  {
    "title": "Amateur astronomer reveals a colorful portrait of Earth's closest star-forming neighbor (photo) - Space",
    "description": "With two globular clusters thrown in for good measure.",
    "source": "Space.com",
    "url": "https://www.space.com/stargazing/astrophotography/amateur-astronomer-reveals-a-colorful-portrait-of-earths-closest-star-forming-neighbor-photo",
    "publishedAt": "2025-05-10T13:00:00Z"
  },
  {
    "title": "New Shark Species Discovered: Pararhincodon Torquis Reveals Ancient Predator from Southern England - Indian Defence Review",
    "description": "A newly discovered fossil shark, Pararhincodon torquis, reveals ancient insights into shark evolution, shedding light on its unique characteristics and migration patterns.",
    "source": "Indiandefencereview.com",
    "url": "https://indiandefencereview.com/new-shark-species-pararhincodon-torquis/",
    "publishedAt": "2025-05-10T13:00:00Z"
  },
  {
    "title": "Saturday Citations: AI predicts cancer survival outcomes; Hubble spots a wandering black hole - Phys.org",
    "description": "This week, physicists at CERN reported the transmutation of lead into gold in the Large Hadron Collider, raising the possibility that a Science X alchemy vertical could be on the horizon. An international research collaborative developed a new method to ident…",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-05-saturday-citations-ai-cancer-survival.html",
    "publishedAt": "2025-05-10T12:50:01Z"
  },
  {
    "title": "Eye Movements Set the Speed Limit for What You Can See - Neuroscience News",
    "description": "The speed of your eye movements, called saccades, determines how fast an object can move before it becomes invisible to you.",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/eye-saccades-visual-speed-28872/",
    "publishedAt": "2025-05-10T12:26:00Z"
  },
  {
    "title": "Hoatzin: The strange 'stinkbird' born with clawed wings that appears to be an evolutionary 'orphan' - Live Science",
    "description": "This weird blue-faced, red-eyed bird smells so bad predators won't eat it.",
    "source": "Live Science",
    "url": "https://www.livescience.com/animals/birds/hoatzin-the-strange-stinkbird-born-with-clawed-wings-that-appears-to-be-an-evolutionary-orphan",
    "publishedAt": "2025-05-10T12:00:00Z"
  },
  {
    "title": "Rogue Pulsar Snaps Galactic Bone in Milky Way’s Spine - Gizmodo",
    "description": "NASA's Chandra Observatory recently captured an X-ray image that helped identify a dramatic break in one of the galaxy's longest filaments.",
    "source": "Gizmodo.com",
    "url": "https://gizmodo.com/rogue-pulsar-snaps-galactic-bone-in-milky-ways-spine-2000599285",
    "publishedAt": "2025-05-10T12:00:00Z"
  }
]