[
  {
    "title": "Scientists Just Uncovered A New Dementia Warning Sign—And It's More Common Than You Think - AOL.com",
    "description": "Some new research suggests that excessive sleepiness may be an early sign of dementia. Here's what one neurologist wants you to know about the findings.",
    "source": "Women's Health",
    "url": "https://www.womenshealthmag.com/health/a64691682/excessive-sleepiness-dementia-symptom-study/",
    "publishedAt": "2025-05-11T06:08:09Z"
  },
  {
    "title": "Can living near golf courses give you Parkinson's? New study reveals how - Times of India",
    "description": "A recent study reveals a concerning link between living near golf courses and an increased risk of Parkinson's dise",
    "source": "The Times of India",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/can-living-near-golf-courses-give-you-parkinsons-new-study-says-so/articleshow/121071144.cms",
    "publishedAt": "2025-05-11T02:29:00Z"
  },
  {
    "title": "New Study Reveals an Easier Alternative to Intermittent Fasting - ScienceAlert",
    "description": "Intermittent fasting is not only a useful tool for weight loss, it's also shown to have many benefits for metabolic health – independent of weight loss.",
    "source": "ScienceAlert",
    "url": "https://www.sciencealert.com/new-study-reveals-an-easier-alternative-to-intermittent-fasting",
    "publishedAt": "2025-05-11T02:01:12Z"
  },
  {
    "title": "7-Day No-Sugar Mediterranean Diet Meal Plan for Weight Loss, Created by a Dietitian - EatingWell",
    "description": "We skip added sugars and incorporate a week of high-fiber, high-protein meals and snacks in this dietitian-created Mediterranean diet meal plan for weight loss.",
    "source": "Eatingwell.com",
    "url": "https://www.eatingwell.com/7-day-no-sugar-mediterranean-diet-meal-plan-for-weight-loss-11729836",
    "publishedAt": "2025-05-11T00:00:00Z"
  },
  {
    "title": "Measles outbreak surpasses 1,000 cases for the first time in 30 years - New York Post",
    "description": "The country’s measles outbreak has surpassed 1,000 cases for the first time in 30 years. The Centers for Disease Control and Prevention confirmed the grim news on Friday.",
    "source": "New York Post",
    "url": "https://nypost.com/2025/05/10/us-news/measles-outbreak-surpasses-1000-cases-for-the-first-time-in-30-years/",
    "publishedAt": "2025-05-10T20:08:00Z"
  },
  {
    "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative - NPR",
    "description": "Women can use a wand to collect a vaginal sample, then mail it to a lab that will screen for cervical cancer. The device will be available by prescription through a telehealth service.",
    "source": "NPR",
    "url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
    "publishedAt": "2025-05-10T18:03:07Z"
  },
  {
    "title": "New findings suggest Alzheimer's may be reversible in some patients - WKRC",
    "description": "A new study from Harvard suggests that some Alzheimer's patients may be able to reverse the effects of the disease through some unexpected methods.",
    "source": "WKRC TV Cincinnati",
    "url": "https://local12.com/news/nation-world/alzheimers-reversible-patients-new-study-disease-memory-mental-cognitive-brain-cognition-diet-lifestyle-healthy-health-healthier-fitness-exercise",
    "publishedAt": "2025-05-10T16:48:54Z"
  },
  {
    "title": "Protein discovered that boosts lifespan, muscle, and brain power with just one dose - Earth.com",
    "description": "Scientists studied s-KL Klotho protein therapy in aging mice, showing potential to improve muscle, bone, and memory health.",
    "source": "Earth.com",
    "url": "https://www.earth.com/news/klotho-s-kl-protein-discovered-boosts-lifespan-muscle-brain-power-with-one-dose/",
    "publishedAt": "2025-05-10T16:39:07Z"
  },
  {
    "title": "'Dark photon' theory of light aims to take down the famous double-slit experiment, upending quantum physics - Earth.com",
    "description": "\"Dark photon\" theory says light's interference patterns may emerge from quantum particles, not waves, upending centuries of physics.",
    "source": "Earth.com",
    "url": "https://www.earth.com/news/dark-photon-theory-casts-doubt-on-double-slit-experiment-quantum-light-interference-pattern/",
    "publishedAt": "2025-05-10T16:24:06Z"
  },
  {
    "title": "Study finds striking differences in life expectancy across U.S. states - The Brighter Side of News",
    "description": "A Yale study shows dramatic differences in life expectancy across U.S. states, linked directly to local health policies and social conditions.",
    "source": "Thebrighterside.news",
    "url": "https://www.thebrighterside.news/post/study-finds-striking-differences-in-life-expectancy-across-u-s-states/",
    "publishedAt": "2025-05-10T16:07:00Z"
  },
  {
    "title": "My Husband Played a Terrifying Prank on Me. So I’ve Figured Out the Perfect Way to Retaliate. - Slate Magazine",
    "description": "I'm furious.",
    "source": "Slate Magazine",
    "url": "https://slate.com/advice/2025/05/marriage-advice-husband-prank-terrifying.html",
    "publishedAt": "2025-05-10T16:00:00Z"
  },
  {
    "title": "Heavy Social Media Use Linked to Believing and Spreading Fake News - Neuroscience News",
    "description": "Individuals who experience high levels of distress and functional impairment from excessive social media use are significantly more likely to believe fake news and interact with it.",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/social-media-misinformation-spread-28879/",
    "publishedAt": "2025-05-10T15:37:49Z"
  },
  {
    "title": "Scientists Discover Hidden Cause of Alzheimer’s Hiding in Plain Sight - SciTechDaily",
    "description": "Researchers found the PHGDH gene directly causes Alzheimer’s and discovered a drug-like molecule, NCT-503, that may help treat the disease early by targeting the gene’s hidden function. A recent study has revealed that a gene previously identified as a biomar…",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/scientists-discover-hidden-cause-of-alzheimers-hiding-in-plain-sight/",
    "publishedAt": "2025-05-10T15:12:50Z"
  },
  {
    "title": "Does Champagne Really Lower Risk of Sudden Cardiac Arrest? Here's The Science. - ScienceAlert",
    "description": "\"My only regret in life is that I didn't drink enough champagne,\" the English economist and philosopher John Maynard Keynes (1883–1946) is reported to have said.",
    "source": "ScienceAlert",
    "url": "https://www.sciencealert.com/does-champagne-really-lower-risk-of-sudden-cardiac-arrest-heres-the-science",
    "publishedAt": "2025-05-10T15:03:44Z"
  },
  {
    "title": "Your Brain Maps Actions Like It Maps Space - Neuroscience News",
    "description": "A new study shows that the human brain organizes action-outcome associations in cognitive maps, much like how it maps physical space for navigation.",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/cognitive-mapping-action-28877/",
    "publishedAt": "2025-05-10T14:46:40Z"
  },
  {
    "title": "AI Tool Reads Faces to Predict Health, Aging, and Cancer Outcomes - Neuroscience News",
    "description": "Researchers have developed an AI tool called FaceAge that uses facial photos to estimate biological age and predict survival outcomes in cancer patients.",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/ai-face-aging-cancer-28876/",
    "publishedAt": "2025-05-10T14:24:38Z"
  },
  {
    "title": "Okra and Fenugreek Extracts Safely Remove Microplastics From Water in New Texas Research - Good News Network",
    "description": "The slimy strings from okra and the gel from fenugreek seeds can trap microplastics better than the slightly-toxic synthetic polymer in use.",
    "source": "Good News Network",
    "url": "https://www.goodnewsnetwork.org/okra-and-fenugreek-extracts-safely-remove-microplastics-from-water-in-new-texas-research/",
    "publishedAt": "2025-05-10T13:43:07Z"
  }
]